Radiacion/Malla80x80/Case-ViewFactor-Ra70000-test3/Case-ViewFactor-Ra70000-test3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cold
    {
        type            wall;
        inGroups        2(wall viewFactorWall);
        nFaces          80;
        startFace       12640;
    }
    hot
    {
        type            wall;
        inGroups        2(wall viewFactorWall);
        nFaces          80;
        startFace       12720;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       12800;
    }
    right
    {
        type            wall;
        inGroups        2(wall viewFactorWall);
        nFaces          80;
        startFace       25600;
    }
    left
    {
        type            wall;
        inGroups        2(wall viewFactorWall);
        nFaces          80;
        startFace       25680;
    }
)

// ************************************************************************* //
