Radiacion/Malla80x80/Case-ViewFactor-Ra70000-test3/Case-ViewFactor-Ra70000-test3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
   "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol         0;
	 
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

      "Ii.*"
    {
        solver              GAMG;
        tolerance           1e-8; 
        relTol              0;
        smoother            symGaussSeidel;
        maxIter             10;
        nPostSweeps         1;
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 5;
    nCorrectors     5;
    nNonOrthogonalCorrectors 0;

    pRefCell       0;
    pRefValue       0;  

}

relaxationFactors
{
   
}

// ************************************************************************* //
